In [1]:
import pandas as pd

In [7]:
#Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona'], 
    'Age': [25, 30, 35, 40, 28, 45],
    'City': ['New York', 'Chicago', 'San Diego', 'Chicago', 'New York', 'San Diego'],
    'Salary': [70000, 80000, 90000, 85000, 72000, 88000]

}

#Create Dataframe 
df = pd.DataFrame(data)

#Display it
df.head(10)

      Name  Age       City  Salary
0    Alice   25   New York   70000
1      Bob   30    Chicago   80000
2  Charlie   35  San Diego   90000
3    Diana   40    Chicago   85000
4    Ethan   28   New York   72000
5    Fiona   45  San Diego   88000

Exercise 1: Filter rows

    Get all rows where the salary is greater than 75,000.